RT-Thread/rt-thread/bsp/nuvoton/libraries/m2354/StdDriver/src/nu_uart.c
    /* Get UART clock source selection and UART clock divider number */
    switch((uint32_t)uart)
    {
        case UART0_BASE:
        case UART0_BASE+NS_OFFSET:
            u32UartClkSrcSel = CLK_GetModuleClockSource(UART0_MODULE);
            u32UartClkDivNum = CLK_GetModuleClockDivider(UART0_MODULE);
            if(u32UartClkSrcSel == 4ul)
                au32ClkTbl[4] = CLK_GetPCLK0Freq();
            break;
        case UART1_BASE:
        case UART1_BASE+NS_OFFSET:
            u32UartClkSrcSel = CLK_GetModuleClockSource(UART1_MODULE);
            u32UartClkDivNum = CLK_GetModuleClockDivider(UART1_MODULE);
            if(u32UartClkSrcSel == 4ul)
                au32ClkTbl[4] = CLK_GetPCLK1Freq();
            break;
        case UART2_BASE:
        case UART2_BASE+NS_OFFSET:
            u32UartClkSrcSel = CLK_GetModuleClockSource(UART2_MODULE);
            u32UartClkDivNum = CLK_GetModuleClockDivider(UART2_MODULE);
            if(u32UartClkSrcSel == 4ul)
                au32ClkTbl[4] = CLK_GetPCLK0Freq();
            break;
        case UART3_BASE:
        case UART3_BASE+NS_OFFSET:
            u32UartClkSrcSel = CLK_GetModuleClockSource(UART3_MODULE);
            u32UartClkDivNum = CLK_GetModuleClockDivider(UART3_MODULE);
            if(u32UartClkSrcSel == 4ul)
                au32ClkTbl[4] = CLK_GetPCLK1Freq();
            break;
        case UART4_BASE:
        case UART4_BASE+NS_OFFSET:
            u32UartClkSrcSel = CLK_GetModuleClockSource(UART4_MODULE);
            u32UartClkDivNum = CLK_GetModuleClockDivider(UART4_MODULE);
            if(u32UartClkSrcSel == 4ul)
                au32ClkTbl[4] = CLK_GetPCLK0Freq();
            break;
        case UART5_BASE:
        case UART5_BASE+NS_OFFSET:
            u32UartClkSrcSel = CLK_GetModuleClockSource(UART5_MODULE);
            u32UartClkDivNum = CLK_GetModuleClockDivider(UART5_MODULE);
            if(u32UartClkSrcSel == 4ul)
                au32ClkTbl[4] = CLK_GetPCLK1Freq();
            break;
        default:
            return;
    }

    /* Select UART function */
    uart->FUNCSEL = UART_FUNCSEL_UART;

    /* Set UART line configuration */
    uart->LINE = UART_WORD_LEN_8 | UART_PARITY_NONE | UART_STOP_BIT_1;

    /* Set UART Rx and RTS trigger level */
    uart->FIFO &= ~(UART_FIFO_RFITL_Msk | UART_FIFO_RTSTRGLV_Msk);

    /* Get PLL clock frequency if UART clock source selection is PLL */
    if(u32UartClkSrcSel == 1ul)
    {
        au32ClkTbl[u32UartClkSrcSel] = CLK_GetPLLClockFreq();
    }

    /* Set UART baud rate */
    if(u32baudrate != 0ul)
    {
        u32BaudDiv = UART_BAUD_MODE2_DIVIDER((au32ClkTbl[u32UartClkSrcSel]) / (u32UartClkDivNum + 1ul), u32baudrate);

        if(u32BaudDiv > 0xFFFFul)
        {
            uart->BAUD = (UART_BAUD_MODE0 | UART_BAUD_MODE0_DIVIDER((au32ClkTbl[u32UartClkSrcSel]) / (u32UartClkDivNum + 1ul), u32baudrate));
        }
        else
        {
            uart->BAUD = (UART_BAUD_MODE2 | u32BaudDiv);
        }
    }
}


/**
 *    @brief        Read UART data
 *
 *    @param[in]    uart            The pointer of the specified UART module.
 *    @param[in]    pu8RxBuf        The buffer to receive the data of receive FIFO.
 *    @param[in]    u32ReadBytes    The the read bytes number of data.
 *
 *    @return       u32Count Receive byte count
 *
 *    @details      The function is used to read Rx data from RX FIFO and the data will be stored in pu8RxBuf.
 */
uint32_t UART_Read(UART_T* uart, uint8_t pu8RxBuf[], uint32_t u32ReadBytes)
{
    uint32_t  u32Count, u32delayno;
    uint32_t  u32Exit = 0ul;

    for(u32Count = 0ul; u32Count < u32ReadBytes; u32Count++)
    {
        u32delayno = 0ul;

        while(uart->FIFOSTS & UART_FIFOSTS_RXEMPTY_Msk)   /* Check RX empty => failed */
        {
            u32delayno++;
            if(u32delayno >= 0x40000000ul)
            {
                u32Exit = 1ul;
                break;
            }
            else
            {
            }
        }

        if(u32Exit == 1ul)
        {
            break;
        }
        else
        {
            pu8RxBuf[u32Count] = (uint8_t)uart->DAT; /* Get Data from UART RX  */
        }
    }

    return u32Count;
}


/**
 *    @brief        Set UART line configuration
 *
 *    @param[in]    uart            The pointer of the specified UART module.
 *    @param[in]    u32baudrate     The register value of baudrate of UART module.
 *                                  If u32baudrate = 0, UART baudrate will not change.
 *    @param[in]    u32data_width   The data length of UART module.
 *                                  - \ref UART_WORD_LEN_5
 *                                  - \ref UART_WORD_LEN_6
 *                                  - \ref UART_WORD_LEN_7
 *                                  - \ref UART_WORD_LEN_8
 *    @param[in]    u32parity       The parity setting (none/odd/even/mark/space) of UART module.
 *                                  - \ref UART_PARITY_NONE
 *                                  - \ref UART_PARITY_ODD
 *                                  - \ref UART_PARITY_EVEN
 *                                  - \ref UART_PARITY_MARK
 *                                  - \ref UART_PARITY_SPACE
 *    @param[in]    u32stop_bits    The stop bit length (1/1.5/2 bit) of UART module.
 *                                  - \ref UART_STOP_BIT_1
 *                                  - \ref UART_STOP_BIT_1_5
 *                                  - \ref UART_STOP_BIT_2
 *
 *    @return       None
 *
 *    @details      This function use to config UART line setting.
 */
void UART_SetLineConfig(UART_T* uart, uint32_t u32baudrate, uint32_t u32data_width, uint32_t u32parity, uint32_t  u32stop_bits)
{
    uint32_t u32UartClkSrcSel, u32UartClkDivNum;
    uint32_t au32ClkTbl[8] = { __HXT, 0ul, __LXT, __HIRC, 0ul, 0ul, 0ul, 0ul};
    uint32_t u32BaudDiv = 0ul;

    /* Get UART clock source selection and UART clock divider number */
    switch((uint32_t)uart)
    {
        case UART0_BASE:
        case UART0_BASE+NS_OFFSET:
            u32UartClkSrcSel = CLK_GetModuleClockSource(UART0_MODULE);
            u32UartClkDivNum = CLK_GetModuleClockDivider(UART0_MODULE);
            if(u32UartClkSrcSel == 4ul)
                au32ClkTbl[4] = CLK_GetPCLK0Freq();
            break;
        case UART1_BASE:
        case UART1_BASE+NS_OFFSET:
            u32UartClkSrcSel = CLK_GetModuleClockSource(UART1_MODULE);
            u32UartClkDivNum = CLK_GetModuleClockDivider(UART1_MODULE);
            if(u32UartClkSrcSel == 4ul)
                au32ClkTbl[4] = CLK_GetPCLK1Freq();
            break;
        case UART2_BASE:
        case UART2_BASE+NS_OFFSET:
            u32UartClkSrcSel = CLK_GetModuleClockSource(UART2_MODULE);
            u32UartClkDivNum = CLK_GetModuleClockDivider(UART2_MODULE);
            if(u32UartClkSrcSel == 4ul)
                au32ClkTbl[4] = CLK_GetPCLK0Freq();
            break;
        case UART3_BASE:
        case UART3_BASE+NS_OFFSET:
            u32UartClkSrcSel = CLK_GetModuleClockSource(UART3_MODULE);
            u32UartClkDivNum = CLK_GetModuleClockDivider(UART3_MODULE);
            if(u32UartClkSrcSel == 4ul)
                au32ClkTbl[4] = CLK_GetPCLK1Freq();
            break;
        case UART4_BASE:
        case UART4_BASE+NS_OFFSET:
            u32UartClkSrcSel = CLK_GetModuleClockSource(UART4_MODULE);
            u32UartClkDivNum = CLK_GetModuleClockDivider(UART4_MODULE);
            if(u32UartClkSrcSel == 4ul)
                au32ClkTbl[4] = CLK_GetPCLK0Freq();
            break;
        case UART5_BASE:
        case UART5_BASE+NS_OFFSET:
            u32UartClkSrcSel = CLK_GetModuleClockSource(UART5_MODULE);
            u32UartClkDivNum = CLK_GetModuleClockDivider(UART5_MODULE);
            if(u32UartClkSrcSel == 4ul)
                au32ClkTbl[4] = CLK_GetPCLK1Freq();
            break;
        default:
            return;
    }

